app/Controllers/Api/V1/AuthController.php

            'password' => password_hash($this->request->getPost('password'), PASSWORD_DEFAULT),
        ];

        $userModel->save($user);
        $userId = $userModel->getInsertID();

        $user = $userModel->select('id, firstname, lastname, email')->find($userId);
---
INSERT INTO `users` (`email`, `firstname`, `lastname`, `password`, `created_at`, `updated_at`) VALUES ('mruser2@gmail.com', 'Mr', 'Jonathon', '$2y$10$XFRoV2xq7dtDhAEACxosn.fdYdi5laAghMOSxbSvLJUum3q1G6072', '2025-05-11 18:07:42', '2025-05-11 18:07:42')
SELECT `id`, `firstname`, `lastname`, `email`
FROM `users`
WHERE `users`.`id` = 9

    public function login()
    {
        $rules = [
            'email'    => 'required|valid_email',
            'password' => 'required',
        ];

        if (!$this->validate($rules)) {
            return $this->response
                ->setStatusCode(400)
                ->setJSON([
                    'success' => false,
                    'error' => $this->validator->getErrors()
                ]);
        }

        $userModel = new User();
        $user = $userModel->where('email', $this->request->getPost('email'))->first();
---
SELECT *
FROM `users`
WHERE `email` = 'user@gmail.com'
 LIMIT 1

    public function profile()
    {
        $userId = $this->request->user->sub;

        $userModel = new User();
        $user = $userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = 4